commands_templates/SetMetadataConfiguration0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/media/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetMetadataConfiguration>
         <wsdl:Configuration token="?">
            <!--type: Name-->
            <sch:Name>?</sch:Name>
            <!--type: int-->
            <sch:UseCount>?</sch:UseCount>
            <!--Optional:-->
            <sch:PTZStatus>
               <!--type: boolean-->
               <sch:Status>?</sch:Status>
               <!--type: boolean-->
               <sch:Position>?</sch:Position>
            </sch:PTZStatus>
            <!--Optional:-->
            <sch:Events>
               <!--Optional:-->
               <sch:Filter>
                  <!--You may enter ANY elements at this point-->
               </sch:Filter>
               <!--Optional:-->
               <sch:SubscriptionPolicy>
                  <!--You may enter ANY elements at this point-->
               </sch:SubscriptionPolicy>
               <!--You may enter ANY elements at this point-->
            </sch:Events>
            <!--Optional:-->
            <!--type: boolean-->
            <sch:Analytics>?</sch:Analytics>
            <sch:Multicast>
               <sch:Address>
                  <!--type: IPType - enumeration: [IPv4,IPv6]-->
                  <sch:Type>?</sch:Type>
                  <!--Optional:-->
                  <!--type: IPv4Address-->
                  <sch:IPv4Address>?</sch:IPv4Address>
                  <!--Optional:-->
                  <!--type: IPv6Address-->
                  <sch:IPv6Address>?</sch:IPv6Address>
               </sch:Address>
               <!--type: int-->
               <sch:Port>?</sch:Port>
               <!--type: int-->
               <sch:TTL>?</sch:TTL>
               <!--type: boolean-->
               <sch:AutoStart>?</sch:AutoStart>
               <!--You may enter ANY elements at this point-->
            </sch:Multicast>
            <!--type: duration-->
            <sch:SessionTimeout>?</sch:SessionTimeout>
            <!--You may enter ANY elements at this point-->
            <!--Optional:-->
            <sch:AnalyticsEngineConfiguration>
               <!--Zero or more repetitions:-->
               <sch:AnalyticsModule Name="?" Type="?">
                  <sch:Parameters>
                     <!--Zero or more repetitions:-->
                     <sch:SimpleItem Name="?" Value="?"/>
                     <!--Zero or more repetitions:-->
                     <sch:ElementItem Name="?">
                        <!--You may enter ANY elements at this point-->
                     </sch:ElementItem>
                     <!--Optional:-->
                     <sch:Extension>
                        <!--You may enter ANY elements at this point-->
                     </sch:Extension>
                  </sch:Parameters>
               </sch:AnalyticsModule>
               <!--Optional:-->
               <sch:Extension>
                  <!--You may enter ANY elements at this point-->
               </sch:Extension>
            </sch:AnalyticsEngineConfiguration>
            <!--Optional:-->
            <sch:Extension>
               <!--You may enter ANY elements at this point-->
            </sch:Extension>
         </wsdl:Configuration>
         <!--type: boolean-->
         <wsdl:ForcePersistence>?</wsdl:ForcePersistence>
      </wsdl:SetMetadataConfiguration>
   </soap:Body>
</soap:Envelope>